vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * connects to MQTT server , publishes LWT message as "online" every time it connects
 * waits for a time defined by MQTT_RETRY_INTERVAL before reconnecting again
 * I had issues with MQTT nto able to connect at times and so I included pinger to ping the gateway but then the issue hasnt happened for a long time now
 */
bool reconnectMQTT()
{
  if (!client.connected())
  {
    long now = millis();
    if ((now - lastReconnectAttempt > MQTT_RETRY_INTERVAL) || lastReconnectAttempt == 0) 
    {
      lastReconnectAttempt = now;
      DPRINTLN("Attempting MQTT connection...");
      // publishes the LWT message ("online") to the topic,If the this device disconnects from the broker ungracefully then the broker automatically posts the "offline" message on the LWT topic
      // so that all connected clients know that this device has gone offline
      char publish_topic[65] = ""; //variable accomodates 50 characters of main topic + 15 char of sub topic
      strcpy(publish_topic,MQTT_TOPIC);
      strcat(publish_topic,"/LWT"); 
      if (client.connect(DEVICE_NAME,mqtt_uname,mqtt_pswd,publish_topic,0,true,"offline")) {//credentials come from secrets.h
        DPRINTLN("MQTT connected");
        client.publish(publish_topic,"online",true);
        if(statusLED.getState() == LED_BLINKING)
          statusLED.cancel();
        return true;
      }
    //   else 
    //   {
    //     DPRINT("failed, rc=");
    //     DPRINT(client.state());
    //     if(pinger.Ping(WiFi.gatewayIP()))
    //     {
    //       DPRINTLN("ping to gateway success");
    //     }
    //     else
    //     {
    //       DPRINTLN("ping to gateway failed");
    //     }
    //   }
    }
    if(statusLED.getState() == LED_IDLE)
      statusLED.blink(1000, 500);
    return false;
  }
  if(statusLED.getState() == LED_BLINKING)
    statusLED.cancel();
  return true;
}

/*
 * publishes a string to MQTT
 */
bool publishToMQTT(const char msg[],const char topic[], bool retain)
{
  if(client.connected())
  {
    if(client.publish(topic,msg,retain))
    {
      DPRINT("publishToMQTT-Published:");DPRINTLN(msg);
      return true;
    }
    else
    {
      DPRINT("publishToMQTT-Failed:");DPRINTLN(msg);
    }
  }
  DPRINTLN("Publish failed - MQTT not connected");
  return false;
}

/*
 * Creates a json string from the espnow message and publishes it to a MQTT queue
 * Returns true if message was published successfully else false
 */
bool publishToMQTT(espnow_message msg) {
  char final_publish_topic[65] = "";
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_BASE_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,msg.device_name); // from here on all messages would be published within this topic specific for this device
  strcpy(final_publish_topic,publish_topic);
  if(msg.msg_type == ESPNOW_SENSOR)
    strcat(final_publish_topic,STATE_TOPIC);// create a topic to publish the state of the device
  else if(msg.msg_type == ESPNOW_OTA)
    strcat(final_publish_topic,OTA_TOPIC);// create a topic to publish the ota state of the device
  else // unknown message type , publish this on the error topic
    strcat(final_publish_topic,ERROR_TOPIC);// create a topic to publish error

  DPRINTF("publishToMQTT:%lu,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  
  StaticJsonDocument<MAX_MESSAGE_LEN> msg_json;
  msg_json["gateway"] = WiFi.hostname();
  msg_json["type"] = msg.msg_type;
  msg_json["mac"] = msg.sender_mac;
  msg_json["id"] = msg.message_id;
  msg_json["device"] = msg.device_name;
  msg_json["ival1"] = msg.intvalue1;
  msg_json["ival2"] = msg.intvalue2;
  msg_json["ival3"] = msg.intvalue3;
  msg_json["ival4"] = msg.intvalue4;
  msg_json["fval1"] = msg.floatvalue1;
  msg_json["fval2"] = msg.floatvalue2;
  msg_json["fval3"] = msg.floatvalue3;
  msg_json["fval4"] = msg.floatvalue4;
  msg_json["char1"] = msg.chardata1;
  msg_json["char2"] = msg.chardata2;
  
  String str_msg="";
  serializeJson(msg_json,str_msg);
  return publishToMQTT(str_msg.c_str(),final_publish_topic,false);
  //DPRINTF("published message with len:%u\n",measureJson(msg_json));
}

/*
 * Creates a message string for motion ON message and publishes it to a MQTT queue
 * Returns true if message was published successfully else false
 */
bool publishMotionMsgToMQTT(const char topic_name[],const char state[4]) {
  char publish_topic[65] = "";
  // create a path for this specific device which is of the form MQTT_BASE_TOPIC/<master_id> , master_id is usually the mac address stripped off the colon eg. MQTT_BASE_TOPIC/2CF43220842D
  strcpy(publish_topic,MQTT_TOPIC);
  strcat(publish_topic,"/");
  strcat(publish_topic,topic_name);
  strcat(publish_topic,"/state");
  return publishToMQTT(state,publish_topic,false);
}

/*
 * Callback when data is sent , It sets the bResultReady flag to true on successful delivery of message
 * The flag is set to false in the main loop where data is sent and then the code waits to see if it gets set to true, if not it retires to send
 */
esp_now_send_cb_t OnDataSent([](uint8_t *mac_addr, uint8_t status) {
  deliverySuccess = status;
  //DPRINT("OnDataSent:Last Packet delivery status:\t");
  //DPRINTLN(status == 0 ? "Success" : "Fail");
  bResultReady = true;
});

/*
 * Callback called on sending a message.
 */
void OnDataRecv(uint8_t * mac, uint8_t *incomingData, uint8_t len) {
  espnow_message msg;
  memcpy(&msg, incomingData, sizeof(msg));
  DPRINTF("OnDataRecv:%lu,%d,%d,%d,%d,%d,%f,%f,%f,%f,%s,%s\n",msg.message_id,msg.msg_type,msg.intvalue1,msg.intvalue2,msg.intvalue3,msg.intvalue4,msg.floatvalue1,msg.floatvalue2,msg.floatvalue3,msg.floatvalue4,msg.chardata1,msg.chardata2);
  
    if(!structQueue.isFull())
      structQueue.enqueue(msg);
    else
      DPRINTLN("Queue Full");
};

