vks007/home_automation/ESPNowGateway_ESP8266/src/main.cpp
/*
 * Initializes the ESP with espnow and WiFi client , OTA etc
 */
void setup() {
  // Initialize Serial Monitor , if we're usng pin 3 on ESP8266 for PIR then initialize Serial as Tx only , disable Rx
  // ATTENTION : this is not working as inteded as PIR still holds Rx as LOW while startup and so the ESP doesnt boot
  // As a temp solution , dont turn ON Serial if you're using Rx as PIR PIN
  #if USING(MOTION_SENSOR)
  if(PIR_PIN == 3)
    {DBEGIN(115200, SERIAL_8N1, SERIAL_TX_ONLY);}
  else
    {DBEGIN(115200);}
  #else
    {DBEGIN(115200);}
  #endif

  printInitInfo();

  // Set the device as a Station and Soft Access Point simultaneously
  WiFi.mode(WIFI_AP_STA); // This has to be WIFI_AP_STA and not WIFI_STA, I dont know why but if set to WIFI_STA then it can only receive broadcast messages
  // and stops receiving MAC specific messages.
  // Set a custom MAC address for the device. This is helpful in cases where you want to replace the actual ESP device in future
  // A custom MAC address will allow all sensors to continue working with the new device and you will not be required to update code on all devices
  uint8_t customMACAddress[] = DEVICE_MAC; // defined in Config.h
  if(wifi_set_macaddr(SOFTAP_IF, &customMACAddress[0]))
    { DPRINT("Successfully set a custom MAC address as:");
      DPRINTLN(WiFi.softAPmacAddress());
    }
    else
    {DPRINT("Failed to set custom MAC address:");}

  pinMode(STATUS_LED,OUTPUT);
  WiFi.config(ESP_IP_ADDRESS, default_gateway, subnet_mask);//from secrets.h
  String device_name = DEVICE_NAME;
  device_name.replace("_","-");//hostname dont allow underscores or spaces
  WiFi.hostname(device_name.c_str());// Set Hostname.


  // For Station Mode
  //wifi_set_macaddr(STATION_IF, &newMACAddress[0]);

  // Set device as a Wi-Fi Station
  WiFi.begin(ssid, password);
  DPRINTLN("Setting as a Wi-Fi Station..");
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    DPRINT(".");
  }
  DPRINT("Station IP Address: ");
  DPRINTLN(WiFi.localIP());
  DPRINT("Wi-Fi Channel: ");
  DPRINTLN(WiFi.channel());
  WiFi.setAutoReconnect(true);

  if((WiFi.status() == WL_CONNECTED))
  {
    client.setServer(mqtt_broker, mqtt_port);// from secrets.h
  }
  // Init ESP-NOW
  if (esp_now_init() != ESP_OK) {
    DPRINTLN("Error initializing ESP-NOW");
    return;
  }
  
  esp_now_set_self_role(MY_ROLE);
  #if USING(SECURITY)
  // Setting the PMK key
  esp_now_set_kok(kok, KEY_LEN);
  byte channel = wifi_get_channel();
  // Add each controller who is expected to send a message to this gateway
  for(byte i = 0;i< sizeof(controller_mac)/6;i++)
  {
    esp_now_add_peer(controller_mac[i], RECEIVER_ROLE, channel, key, KEY_LEN);
    DPRINTFLN("Added controller :%02X:%02X:%02X:%02X:%02X:%02X",controller_mac[i][0],controller_mac[i][1],controller_mac[i][2],controller_mac[i][3],controller_mac[i][4],controller_mac[i][5] );
  }
   #endif

  esp_now_register_send_cb(OnDataSent);
  esp_now_register_recv_cb(OnDataRecv);
  DPRINT("WiFi address:");DPRINTLN(WiFi.macAddress());
  DPRINT("SoftAP address:");DPRINTLN(WiFi.softAPmacAddress());

  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else { // U_FS
      type = "filesystem";
    }

    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    DPRINTLN("Start updating " + type);
  });
  ArduinoOTA.onEnd([]() {
    DPRINTLN("\nEnd");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    DPRINTF("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    DPRINTF("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      DPRINTLN("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      DPRINTLN("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      DPRINTLN("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      DPRINTLN("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      DPRINTLN("End Failed");
    }
  });
  ArduinoOTA.begin();
  #if(USING(ESPNOW_OTA_SERVER))
  config_webserver();
  #endif
  reconnectMQTT(); //connect to MQTT before publishing the startup message
  if(publishHealthMessage(true)) //publish the startup message
    initilized = true;
  #if USING(MOTION_SENSOR)
  if(!motion_sensor.begin(MOTION_SENSOR_NAME)) //initialize the motion sensor
    DPRINTLN("Failed to initialize motion sensor");
  #endif
  
}


/*
 * runs the loop to check for incoming messages in the queue, picks them up and posts them to MQTT
 */
void loop() {
  //check for MQTT connection
  if (!client.connected()) 
  {
    reconnectMQTT(); // Attempt to reconnect
  } else {
    client.loop(); // Client connected
  }
  MQTT_wd.update(client.connected()); //feed the watchdog by calling update
  
  #if USING(MOTION_SENSOR)
  short motion_state = motion_sensor.update();
  if(motion_state == 1)
  {
    DPRINTLN("Motion detected as ON");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"on");
  }
  else if(motion_state == 2)
  {
    DPRINTLN("Motion detected as OFF");
    publishMotionMsgToMQTT(motion_sensor.getSensorName(),"off");
  }
  #endif

  ArduinoOTA.handle();
  
  if(client.connected())
  {
    if(!structQueue.isEmpty())
      if(!retry_message)
        currentMessage = structQueue.dequeue();
      //else last message content is still there is currentMessage
    
    if(currentMessage != emptyMessage)
    {
      DPRINTFLN("Processing msg:%lu,%d",currentMessage.message_id,currentMessage.msg_type);
      if(currentMessage.msg_type == ESPNOW_SENSOR)
      {
        if(publishToMQTT(currentMessage))
        {
          message_count++;
          currentMessage = emptyMessage;
        }
        else
        {
          retry_message = true;
        }//else the same message will be retried the next time
      }
      #if(USING(ESPNOW_OTA_SERVER))
      else if(currentMessage.msg_type == ESPNOW_OTA)
      {
        if(esp_ota_device.ota_mode)
        {
          char buffer[18];
          sprintf(buffer, "%02X:%02X:%02X:%02X:%02X:%02X",esp_ota_device.mac[0],esp_ota_device.mac[1],esp_ota_device.mac[2],esp_ota_device.mac[3],esp_ota_device.mac[4],esp_ota_device.mac[5] );
          if(xstrcmp(buffer,currentMessage.sender_mac))
          {
            esp_ota_device.ota_mode = false;
            esp_ota_device.ota_done = true;
            delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
            DPRINTLN("OTA successfuly completed for device:");
          }
          else
            DPRINTFLN("MAC address of OTA device did not match. Target mac: %s , MAC in msg: %s",buffer,currentMessage.sender_mac);
        }
        else
          DPRINTLN("OTA ack message received when not in OTA mode, ignoring...");
        // pubish the OTA message to MQTT
        publishToMQTT(currentMessage);
        message_count++;
        currentMessage = emptyMessage;
      }
      #endif
      else
      {
        DPRINTLN("message received without msg_type set, ignoring...");
        message_count++;
        currentMessage = emptyMessage;
      }
    }
  }

  // try to publish health message irrespective of the state of espnow messages
  if(millis() - last_time > HEALTH_INTERVAL)
  {
    // It might be possible when the ESP comes up MQTT is down, in that case an init message will not get published in setup()
    // The statement below will check and publish the same , only once
    if(!initilized)
    {
      if(publishHealthMessage(true))
        initilized = true;
    }
    //Now publish the health message
    publishHealthMessage();
    last_time = millis(); // This is reset irrespective of a successful publish else the main loop will continously try to publish this message
  }
  statusLED.loop();

  #if(USING(ESPNOW_OTA_SERVER))
  if(esp_ota_device.ota_mode && !esp_ota_device.ota_done)
  {
    if(millis() < (start_time + OTA_TRIGGER_DURATION*1000))
    {
      if((millis() - last_msg_sent_time) > OTA_MSG_INTERVAL)
      {
        myData.message_id = millis();
        bool result = sendESPnowMessage(&myData,esp_ota_device.mac,0,false);
        last_msg_sent_time = millis();
        if(result)
        {
          //DPRINTFLN("%lu: sent OTA message",myData.message_id);
        }
        else
        {
          DPRINTFLN("%lu: OTA message sending failed",myData.message_id);}
      }
    }
    else
    {
      esp_ota_device.ota_mode = false;
      esp_ota_device.ota_done = true;
      delete_peer(esp_ota_device.mac);// now that we're done with OTA , delete the peer
      DPRINTLN("OTA timed out without acknowlegdment from device");
    }
  }
  #endif

}
